CSI API ETABS v1
cCaseResponseSpectrum.SetEccentricity Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetEccentricity(
	string Name,
	double Eccen
)
Function SetEccentricity (
	Name As String,
	Eccen As Double
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim Eccen As Double
Dim returnValue As Integer
returnValue = instance.SetEccentricity(Name,
	Eccen)
int SetEccentricity(
	String^ Name,
	double Eccen
)
abstract SetEccentricity :
        Name : string *
        Eccen : float -> int
Parameters
Name
Type: System.String
Eccen
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace